#Область ПрограммныйИнтерфейс

// Дополняет формы документов  полем "Контактное лицо"
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма Документов, переданная в параметре Форма процедуры общего модуля
//                             
Процедура ДополнитьФорму(Форма) Экспорт
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма);
		ДобавитьКомандуПересчитатьТаблицыВГруппаГруппаШапкаПраво(Форма);				
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	//Добавляет на форму поле КонтактноеЛицо ниже поля Договор
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
КонецПроцедуры


Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	//Добавляет на форму поле КонтактноеЛицо ниже поля Сумма
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Net_КонтактноеЛицо";
КонецПроцедуры

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаЛево(Форма)
	//Добавляет на форму поле Согласованная скидка 
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.Net_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "Net_СогласованнаяСкидкаПриИзменении");
КонецПроцедуры

Процедура  ДобавитьКомандуПересчитатьТаблицыВГруппаГруппаШапкаПраво(Форма)
	//Добавляет на форму поле команды Пересчитать таблицы
	
	НоваяКоманда = Форма.Команды.Добавить("Net_ПересчитатьТаблицы");
	НоваяКоманда.Заголовок = "ПересчитатьТаблицы";
	НоваяКоманда.Действие = "Net_ПересчетТабличныхЧастей"; //указываем только имя процедуры 
	
	НовыйЭлемент = Форма.Элементы.Добавить("ПересчитатьТаблицы", Тип("КнопкаФормы"),Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Заголовок = "ПересчитатьТаблицы";
	НовыйЭлемент.ИмяКоманды = "Net_ПересчитатьТаблицы";	
КонецПроцедуры

#КонецОбласти
